[
    {
        "title": "Turning An Idea Into A Reality",
        "pubDate": "2022-01-26 15:37:49",
        "link": "https://medium.com/@athletecoder/turning-an-idea-into-a-reality-a75af7170fc3?source=rss-bfbe96e0fb27------2",
        "guid": "https://medium.com/p/a75af7170fc3",
        "author": "John Nguyen",
        "thumbnail": "https://cdn-images-1.medium.com/max/1024/0*k6DYMimQrjXLMJif",
        "description": "\n<h4>I built an app</h4>\n<p>Jazz music was quietly playing in the background, my laptop rested on the coffee table in front of me, and a Coconut Vietnamese coffee accompanied it. Coconut Vietnamese coffee soon became my new favo...</p>",
        "content": "\n<h4>I built an app</h4>\n<p>Jazz music was quietly playing in the background, my laptop rested on the coffee table in front of me, and a Coconut Vietnamese coffee accompanied it. Coconut Vietnamese coffee soon became my new favorite. I could feel the soreness in my bum beginning to kick in from sitting on a hard wooden chair for over 2 hours. I suddenly notice my teeth gnawing at a fingernail. I pull my finger away from my mouth and lay them on the table.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*k6DYMimQrjXLMJif\"><figcaption>Photo by <a href=\"https://unsplash.com/@romanbozhko?utm_source=medium&amp;utm_medium=referral\">Roman Bozhko</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>I took my gaze away from the screen and moved it to the view in front of me. The sun beamed through the glass windows. The light faded to a dim from the left side of the coffee shop to the right side. There were tables neatly placed around the coffee bar below. The shop was wrapped around with roads and trees. The different shades of green elevated the sense of life. People on motorbikes would constantly speed past. Most were single riders, but some would have multiple passengers. On occasion, I would see riders with multiple boxes stacked on top of each other balancing on the back of the bike. How did they not fall over?</p>\n<p>“What are you going to do with your life,” I asked myself.</p>\n<p>This question seemed to be a common occurrence at the time. I would typically tell myself that I’m going to be a professional football player. But, when I would tell myself that I truly didn’t believe it. The dream of playing professional football seemed unattainable. It seemed beyond my reach. I lost faith.</p>\n<p>After what felt like hours, but was only a couple of minutes, the space between each thought began to expand. And then suddenly It became quiet inside my head for a long brief moment.</p>\n<p>“What if I can create a tool and/or service tailored to athletes, like myself, to help them enhance their training?”</p>\n<p>And that’s the first time the idea popped into my head. At the time, in 2019, I was on my soul-searching trip through Vietnam. The issue was I didn’t know how to bring that idea to life. I didn’t have enough money. Most of the money I made was already invested in this trip. And I didn’t have the knowledge or skills to build it on my own. I only knew the basics of HTML, CSS, and JavaScript (JS).</p>\n<p>Fast forward to the end of January of 2020 (I abandoned the idea for a while), I was in Louisville, Kentucky employed as an IT Consultant. Most days I would arrive at the office about 10 minutes before 9, place a k-cup in the coffee machine, ponder what I’m doing with myself, grab my coffee and then walk over to my desk. I was hardly engaged with what I was doing, so I found myself constantly wondering about life. But one day, the idea reappeared in my thoughts. I felt determined. I told myself I had nothing to lose and all the world to gain.</p>\n<p>I brainstormed a couple of strategic options. I came down to two. I could wait until I had enough money to invest in contractors to build it for me, or I could teach myself the skills to do it on my own. The journey to do it on my own had less risk and more benefits if failure was the outcome. I also knew it was going to be a challenge.</p>\n<p>I typed into the Google search bar, “How to build an application from scratch?” “Have an idea, create a plan, and execute.” I already knew most of these things. I was asking the wrong questions. I needed to know exactly what tech stack I was going to use and how I was going to apply them.<br> I had experience with JS so I stuck with it. NodeJs as the backend environment and JS, HTML, and CSS as the frontend. Doing additional research on frontend development, I stumbled upon JS frameworks. What I learned is that JS frameworks are prewritten JS code that allows for easier development. There were multiple JS frameworks to choose from; <strong>React</strong>, Vue and Angular were the most popular. <a href=\"https://reactjs.org/\"><strong>React</strong></a> seemed the most appealing based on popularity, so I decided to go with it.</p>\n<p>I typed, “Tutorials on React,” into Google’s search bar. <a href=\"http://udemy.com/\">Udemy</a> was the first result. It was a website I’ve heard about before through numerous ads. I arrived on Udemy’s website, created an account, and found a course called, “Modern React and Redux.” I didn’t know what Redux was, but it had plenty of reviews and almost a 5-star rating so I bought it.</p>\n<p>5:30 the next morning, and I’m in my apartment sitting in front of my laptop computer screen starting the first lesson of “Modern React and Redux.” And for the next month and a half, I would spend most mornings, for an hour or so, tackling each instructional video.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*a3L7KQrSEtxsa2-c\"><figcaption>Photo by <a href=\"https://unsplash.com/@altumcode?utm_source=medium&amp;utm_medium=referral\">AltumCode</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>After completing the course, I had a good understanding of the React Framework and how <a href=\"https://react-redux.js.org/\">Redux</a> integrated with it. But I needed to apply what I learned to reality.</p>\n<p>A good buddy of mine recently started a podcast that focused on reviewing books and beers. It was the perfect opportunity for me to apply what I learned so I created a website for them.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*FEMaWPMT6h-QopBZ_OUQFg.png\"><figcaption>The homepage of the website I created for the podcast</figcaption></figure><p>The website had a store, blog, admin panel, and basic pages that every website needs. The store was the most difficult to implement. <a href=\"https://stripe.com/\"><strong>Stripe’s API</strong></a> (payment processor) documentation was very easy to go through, but figuring out how to configure the process from item to cart, and then cart to checkout was difficult.</p>\n<p>I continued building other websites for leisure. Coming up with random ideas and then trying to bring those ideas to life. Then one day, I stumbled upon React Native when I was scrolling through Youtube. <a href=\"https://reactnative.dev/\">React Native</a> is a framework used to develop mobile and web applications, but mainly used for mobile applications.</p>\n<p>“Why not?” I asked myself. I already have experience with React. The world is going towards mobile devices if it hasn’t already. It will be a useful skill to have under my belt. Plus, my training idea will need to be mobile-first.</p>\n<p>I googled “React Native,” navigated to their website, clicked on the “Get Started” button on the homepage, and then skimmed through their documentation. For newbies, like myself, the documentation recommended using <a href=\"https://expo.dev/\"><strong>Expo CLI</strong></a> to get started. So I dove right into it.</p>\n<p>For my first mobile application with React Native, I built a social networking application called, “LetsLink.” It was an app where you were only shown other users within a 1-mile radius. It was complex, but I learned more about how to interact with APIs and honed my skills in React and Redux.</p>\n<p>In my next app, I was a little intimidated at first, but I ejected my Expo CLI app into a bare workflow environment. Soon I came to realize it wasn’t as bad as I thought, and that Google is my best friend.</p>\n<p>In July of 2021, I was in San Diego, CA visiting my brother. It was a sunny afternoon and I was taking a stroll along the beach. A couple of hours prior, I submitted my first app to the app store. It was a <a href=\"https://habt-b0f23.web.app/\">habit tracker app</a>. I felt confident. “I’m ready,” I whispered to myself with the thought of my main idea in mind.</p>\n<p>The following day at about 6:30 AM, I walked over, with a black coffee in hand, to my brother’s standing desk with my laptop resting on top of it. I opened the lid of the laptop and took a couple of sips of coffee while I waited for the laptop to boot up. When the login screen displayed I took one last sip of my coffee and rested the coffee mug to the left of my laptop. I typed in my login credentials.</p>\n<p>I spent the next 4 hours or so brainstorming the functionalities of the app, and creating a broad timeline of the process from scratch to launch. I planned for the app to be on the app store towards the end of December of 2021, so that gave me about 4 months.</p>\n<p>That same afternoon, after working out and spending some downtime with family and friends, I found myself back at the desk working on designing the prototype in <a href=\"https://www.figma.com/\">Figma</a> (a prototype software). I spent the next week designing a prototype of the app. Design isn’t my strong suit, but I tried my best to say the least.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*IS1mh5NZIwsxM5hg\"><figcaption>Photo by <a href=\"https://unsplash.com/@balazsketyi?utm_source=medium&amp;utm_medium=referral\">Balázs Kétyi</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>I was looking outside the airplane window on my way back to Seattle, WA. Being above the clouds makes you wonder if you could just choose to see the brighter side of things. Sometimes we get so caught up below the clouds that we don’t even wonder what’s above it.</p>\n<p>Is this going to work? Are people going to like it? What if it fails? It’s going to be embarrassing.</p>\n<p>These negative self-degrading thoughts make a frequent occurrence throughout my pursuit for the next couple of months. I had no choice but to implement a routine to keep these thoughts at bay.</p>\n<p>I was normally awake at 6:00 AM. Made coffee, took out the dogs, meditated for 10 minutes, and worked from 6:30 -7:00 AM until about 10:00 AM — 11:00 AM. I worked in 90-minute intervals with 20-minute breaks in between. Then I would eat breakfast, work out, and be back at it at around 2:00 -3:00 PM until about 6:00–7:00 PM. I would have dinner, and then, depending on how I was feeling, I would squeeze in another hour or so before I would get ready for bed. I was in bed at around 9:00 PM and asleep at 10:00 PM. I was consistent most days, but obviously, life and procrastination would sometimes get in the way.</p>\n<p>It’s always the first couple of minutes of my work session where my mind would complain about how I don’t want to be doing this right now. And then suddenly, my mind would transition into a deep state of focus on the task at hand. I started to enjoy diving into those work sessions.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*-umRWDH1aVlAH_7C\"><figcaption>Photo by <a href=\"https://unsplash.com/@avirichards?utm_source=medium&amp;utm_medium=referral\">Avi Richards</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>It’s Mid-December and I had an overwhelming amount of work to be done. I’ve made significant progress, but there was a lot of design and content configuration that needed to be done. I audibled and planned for the app to be completed by the end of December and to hopefully submit the app towards the beginning of January.</p>\n<p>January 10th, I was in Denver, Colorado visiting a friend I met in college. It was an early Friday morning, the sun beamed through the window and onto my face. I’m standing at a tall round wooden table with my laptop resting on top of it. I feel a sense of relief as I hit the submit button. My app is finally done. For now.</p>\n<p>This was only the start of this app’s journey. This first release was just the MVP (minimal viable product) version. More like a beta version. This app still needs a lot of work. I know things didn’t go exactly how I planned in July, but I’m glad I accomplished my main goal and that was to complete and submit the app.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*BncmMbXS9mSNgh6H\"><figcaption>Photo by <a href=\"https://unsplash.com/@nullplus?utm_source=medium&amp;utm_medium=referral\">Razvan Chisu</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Feel free to check out the app I created <a href=\"https://www.softlete.com/\">here</a>. Let me know what you think through the feedback form on the website.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=a75af7170fc3\" width=\"1\" height=\"1\" alt=\"\">\n",
        "enclosure": {},
        "categories": [
            "entrepreneurship",
            "ideas",
            "app-development",
            "fear-of-failure",
            "coding"
        ],
        "id": "a75af7170fc3"
    },
    {
        "title": "What I Experienced Creating An MVP",
        "pubDate": "2022-02-03 15:35:00",
        "link": "https://medium.com/@athletecoder/what-i-experienced-creating-an-mvp-3d2702c7a925?source=rss-bfbe96e0fb27------2",
        "guid": "https://medium.com/p/3d2702c7a925",
        "author": "John Nguyen",
        "thumbnail": "https://cdn-images-1.medium.com/max/1024/0*K-PkoDguzwtqEsw9",
        "description": "\n<h4>4 months (over 1000 hours).</h4>\n<p>I want to be completely honest. I live at home with my mom and I volunteer for a nonprofit organization part-time. So I have more free time than most people who have full-time jobs to spend working on...</p>",
        "content": "\n<h4>4 months (over 1000 hours).</h4>\n<p>I want to be completely honest. I live at home with my mom and I volunteer for a nonprofit organization part-time. So I have more free time than most people who have full-time jobs to spend working on this app.</p>\n<p>On July 26th, 2021 I began working on the mock-up of my training app. From then to January of 2022, I spent an average of 8 hours a day, over 1000 hours in total, slowly building this app. It was a slow, long, and dreadful process, but it was worth it.</p>\n<h3>Issues I had During The Process</h3>\n<p>Most of the issues I had were self-inflicting. Not physically, but emotionally and mentally. I would constantly doubt my abilities. I would say to myself,</p>\n<blockquote>“Nobody is going to like my app. There will be something wrong with it. People are going to make fun of me. It’ll be embarrassing. Is it even worth it?”</blockquote>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*K-PkoDguzwtqEsw9\"><figcaption>Photo by <a href=\"https://unsplash.com/@surface?utm_source=medium&amp;utm_medium=referral\">Surface</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Being a 26-year-old adult living with my mother didn’t help either. In America, at the age of 18, you are expected to be on your own. You go to college and then right into the workforce. You are expected to have your life together before the age of 26.</p>\n<p>So I neglected most of my social life spending most days at home. I would occasionally meet up with a few friends, but I hated when they would ask me, “what have you been up to?” And when I would explain to them my endeavors, there would be a confused look on their faces. Then spend emotional energy to get them to understand, but it always ended up in my disappointment.</p>\n<blockquote>Nobody can truly understand your perspective, your vision, your dreams.</blockquote>\n<p>But the idea of being alone in my pursuits wasn’t new to me. I felt like most of my life I’ve had dreams that nobody understood or believed in. But I knew that the only opinion that truly mattered was mine.</p>\n<h3>How I Coped With My Issues</h3>\n<h3>Routine</h3>\n<p>Routine. Routine. Routine.</p>\n<p>I briefly outline my routine in my <a href=\"https://medium.com/@athletecoder/turning-an-idea-into-a-reality-a75af7170fc3\">previous post</a>, but I can’t emphasize enough how important a routine is and how it significantly improved my well-being and productivity.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*13hu8fUOz6vcN0h2\"><figcaption>Photo by <a href=\"https://unsplash.com/@jazminantoinette?utm_source=medium&amp;utm_medium=referral\">Jazmin Quaynor</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><h4>Anxiety improved significantly.</h4>\n<blockquote>Anxiety thrives from the unknown.</blockquote>\n<p>I was adventuring into the unknown. I didn’t know exactly what the outcome was going to be. And when I would spend too much time thinking about what could happen, my mind assumed the worse. I was scared.</p>\n<blockquote>Adventuring into the unknown isn’t so bad after all if you take it one day at a time.</blockquote>\n<p>Taking it one day at a time helped me realize the negative thoughts in my mind were all an illusion. We don’t know what will happen in the future.</p>\n<p>Routine gave me a sense of control over my life. I knew what was coming next. Everything was predictable from one task to another.</p>\n<p>And when I would rest my head on my pillow at night I could reflect on the day and be proud of myself for the progress I made.</p>\n<h4>Productivity stayed consistent.</h4>\n<p>We are habitual creatures. Once a habit is established, the effort to perform the activity becomes effortless. And a routine is, by definition, a sequence of daily habits.</p>\n<p>Our habits allow us if chosen and implemented correctly, to minimize <strong><em>decision fatigue</em></strong>. The concept behind decision fatigue</p>\n<blockquote>“is that a human’s ability to make decisions can get worse after making many decisions, as their brain will be more fatigued.” — <a href=\"https://www.medicalnewstoday.com/articles/decision-fatigue#what-is-it\">Medical News Today</a>\n</blockquote>\n<p>I wanted to conserve my energy to be primarily exerted on my work rather than on making decisions on things that can be automated. This robotic way of life is necessary for me to be consistent.</p>\n<p>A work block consists of 90 minutes of work and a 20-minute break. In the article, “<a href=\"https://hubermanlab.com/teach-and-learn-better-with-a-neuroplasticity-super-protocol/\">TEACH &amp; LEARN BETTER WITH A “NEUROPLASTICITY SUPER PROTOCOL</a>” by Andrew Huberman,</p>\n<blockquote>“Solid research shows that 90 minutes is about the longest period we can expect to maintain intense focus and effort toward learning.” — Andrew Huberman.</blockquote>\n<p>I came to figure out that 4 sessions a day were my limit. 2 sessions in the morning and 2 sessions in the afternoon.</p>\n<h3><strong>Social Media</strong></h3>\n<p>Have you ever caught yourself mindlessly scrolling through Instagram, Youtube, and/or other social media platforms? Sometimes I will catch myself in the act of scrolling and ask myself, “What am I doing?” But then continue to scroll.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*FcAzrGhEF5nNIQSG\"><figcaption>Photo by <a href=\"https://unsplash.com/@georgiadelotz?utm_source=medium&amp;utm_medium=referral\">Georgia de Lotz</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Social media can be very helpful, especially Youtube. When an issue arises, Youtube is one of the top places on the internet I go to to find the answer. Youtube is also filled with a ton of aspiring content that motivated me to keep going.</p>\n<blockquote>The algorithm is fighting for your attention.</blockquote>\n<p>I’ll be watching a video I intended to watch. And then my curiosity gets the best of me. I’ll scan the recommended videos and I’ll come across an interesting title or thumbnail. Without thinking, I’ll click on that video. And an hour later, I’ll be down this rabbit hole. Repeating the same process over and over again.</p>\n<p>Most of us use social media as our entertainment of choice. So I’m not saying to abandon it, but to be aware of when and how you are using it.</p>\n<h3>Pros of building an MVP</h3>\n<h4>It’s significantly cheaper than outsourcing</h4>\n<p>The tech stack I chose to use was free to get started building. <strong>MongoDB</strong> and <strong>Firebase</strong> have free tiers for development purposes. <strong>Node</strong> and <strong>React Native</strong> are open sources and free to use.</p>\n<p>Going live will require some money. For me, I tried my best to spend the least amount of money possible. Below is the list of my monthly expenses after going live.</p>\n<ul>\n<li>Heroku ~ $7.00 / Month</li>\n<li>MongoDB ~ $50.00 / Month</li>\n<li>Domain ~ $5.00 / Month</li>\n<li>Custom Email ~ $12 / Month (Maybe, not necessary for MVP)</li>\n<li>Apple Developer Program Fee ~ $99 / Year (IOS Apps)</li>\n</ul>\n<p>It cost me about $83 per month to have my app live plus a bunch of time to get my product built.</p>\n<h4><strong>Becoming more skillful</strong></h4>\n<p>Have you ever heard of the compound effect? The concept of it all is that small habits compound over time.</p>\n<figure><img alt=\"https://jamesclear.com/continuous-improvement\" src=\"https://cdn-images-1.medium.com/max/700/0*mNyQgkUpXy0v7joC.jpg\"><figcaption><a href=\"https://jamesclear.com/continuous-improvement\">Continuous Improvement:<br>How It Works and How to Master It</a></figcaption></figure><blockquote>“If you get one percent better each day for one year, you’ll end up thirty-seven times better by the time you’re done.” —<a href=\"https://jamesclear.com/continuous-improvement\"><em> James Clear</em></a>\n</blockquote>\n<p>The small actions add up over time! So the more I apply my skills daily, the exponentially better I will become at it.</p>\n<p>And the more skillful you become the more competitive advantage you have in the labor market. And If the product you build performs decently, then it shows potential clients and/or employers your competence.</p>\n<h4>Identifying Your Limits</h4>\n<p>At about 7–8 hours of work, my energy levels are significantly drained. It becomes difficult for me to focus and my productivity takes a significant hit.</p>\n<p>There are some days when I would get stuck on a problem and I ended up working 10 hours that day. But I soon found out that I’ve had more trouble sleeping those nights and was less productive the next day.</p>\n<p>I don’t know how some people can work beyond 8 hours a day consistently. I guess some people are built differently. I admire it.</p>\n<p>I also learned that I can’t function effectively without a sufficient amount of sleep. For me, the least I can get away with was 7 hours. Anything less than 7 hours I’m a zombie. 8 hours of sleep is what I aim for.</p>\n<blockquote>Getting enough quality sleep is even more important to our physical and mental health than diet and exercise.</blockquote>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*5A-Hc1yNPW7n69fd\"><figcaption>Photo by <a href=\"https://unsplash.com/@twinsfisch?utm_source=medium&amp;utm_medium=referral\">Isabella and Zsa Fischer</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Matthew Walker, a scientist and professor of neuroscience and psychology who specializes in sleep, explains the importance of sleep and the severe side effects if we don’t get enough sleep in his book, “<a href=\"https://www.amazon.com/Why-We-Sleep-Unlocking-Dreams/dp/1501144316\">Why We Sleep</a>.” You should give it a read.</p>\n<h3>Cons of building an MVP</h3>\n<h4>Time &amp; Hard Work (Expected)</h4>\n<p>Building an app requires discipline over a long time. It is not an easy goal. It’s like a rollercoaster ride.</p>\n<p>It’s somewhat easy at first. You are motivated and inspired by your idea so you start off sprinting. You are eager to get up in the morning so you can get working on your project.</p>\n<p>But as you know, motivation fades. And when my motivation faded, about a month in, I relied on my routine to sustain my productivity.</p>\n<p>Expect your motivation to fade and have a plan. For me, my plan was a routine. Like I stated previously, A routine made it significantly easier for me to get myself at my desk and work.</p>\n<h4>Money</h4>\n<p>Most products, if not all, require some initial investment. Previously, I stated that it cost me about $83 per month to have my app live. I wouldn’t consider this a large amount of money, but it still cost me money.</p>\n<p>The amount of money needed will vary from project to project. Depending on your project, it might require more or less than $83 a month. Beforehand, do your research to ensure you have the proper financial resources to support your product.</p>\n<h3>Just Do It</h3>\n<p>It will be difficult, but you can do it. Don’t focus too much on the outcome. Focus on what is needed of you daily. Take each day one at a time. Be aware of your thoughts. If you have anxiety issues, established a routine.</p>\n<blockquote>The future is nearly unpredictable, so choose to be optimistic about it.</blockquote>\n<p>Failure and regret are both painful experiences. But,</p>\n<blockquote>Failure is only temporary. Regret lasts forever.</blockquote>\n<p>Failure is an inevitable experience in the process<strong> </strong>of you becoming the best version of yourself.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*O7uxEBtk4q5-ZXFr\"><figcaption>Photo by <a href=\"https://unsplash.com/@clarktibbs?utm_source=medium&amp;utm_medium=referral\">Clark Tibbs</a> on <a href=\"https://unsplash.com/?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>If you have an idea, and you truly think it’s valuable, then you should go for it. I mean, why not? There’s only good that comes from the experience of trying. And what if everything works out in your favor? Then that will be awesome!</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=3d2702c7a925\" width=\"1\" height=\"1\" alt=\"\">\n",
        "enclosure": {},
        "categories": [
            "anxiety",
            "mvp-development",
            "overcoming-fear",
            "habits",
            "app-development"
        ],
        "id": "3d2702c7a925"
    },
    {
        "title": "Linear-Gradient Underline Text",
        "pubDate": "2022-02-05 16:03:21",
        "link": "https://medium.com/@athletecoder/linear-gradient-underline-text-4e42d28aa343?source=rss-bfbe96e0fb27------2",
        "guid": "https://medium.com/p/4e42d28aa343",
        "author": "John Nguyen",
        "thumbnail": "https://cdn-images-1.medium.com/max/1024/1*26ORk5xONOslnMiFgnsR1w.png",
        "description": "\n<h4>Let’s walk through it, or you can just skip to the end for the code!</h4>\n<p>See that cool gradient underline? That’s what I’m going to be showing you how to do in this post. Let's get right into it....</p>",
        "content": "\n<h3>Make A Linear-Gradient Underline Text</h3>\n<h4>Let’s walk through it, or you can just skip to the end for the code!</h4>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*mD3qcT_yL8OC5GxUGSBjJA.png\"><figcaption>Linear-Gradient Underline Text</figcaption></figure><p>See that cool gradient underline? That’s what I’m going to be showing you how to do in this post. Let's get right into it.</p>\n<p>I’ll use <a href=\"http://codesandbox.io/\">codesandbox.io</a> for this illustration, but you can use whatever code editor you so choose.</p>\n<p>Let’s create a basic layout of a page.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*CfEvjW3xrVBrGLkjI9STtQ.png\"><figcaption>codesandbox.io</figcaption></figure><p>We now have the basic layout of the page with “Hello Everyone” wrapped with an <strong>h1</strong> tag and displayed on the page.</p>\n<p>In terms of content, we have everything we need in between the <strong>html</strong> tags. It’s time for styling.</p>\n<p>To add <strong>CSS </strong>styles, we need to add the <strong>style</strong> tags above or below the <strong>html</strong> tags. Let's place it above and add the initial styles for our <strong>h1</strong> text.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*KuP62ApaasDdrjUx9kI5Eg.png\"></figure><p>We made the font size 40 pixels and the font color black.</p>\n<p>Now we can get to what you came here for. Adding the cool underline style.</p>\n<p>We first need to add a background color. I chose grey. I thought it complimented the black well, but you can use any color combination. Just replace the <strong>rgba</strong> values.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*bbPVyTeqbJdpI2ErzSYysQ.png\"></figure><p>We have to use the <strong>background-image </strong>property with <strong>linear-gradient</strong> instead of the <strong>background </strong>property.</p>\n<p>For some browsers, linear-gradient might need a prefix. You can learn more about it at <a href=\"https://www.w3schools.com/cssref/func_linear-gradient.asp\">w3schools.com</a>.</p>\n<p>I tried the background property, but the additional properties we will be adding do not apply to the background property.</p>\n<p>There’s already an issue with the background color extending beyond the text. We’ll fix that now.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*BmeXcxz3TeofSATNZfL9BA.png\"></figure><p>We set the <strong>display</strong> property as <strong>inline</strong> to make the width and height of the h1 tag the same as its content.</p>\n<p>Now, need to adjust the size and position of the background.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*ovrse_E1X9HtkHMBVCkonQ.png\"></figure><p>We adjust the size and position of the background based on the size of the font using <strong>em.</strong></p>\n<p>And we also made the width of the background 100% to cover the size of the content.</p>\n<p>Notice the background did not change when we add the<strong> background-size</strong> and <strong>background-position</strong> properties. We just need to add one more property.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*l3Y27gGKoamnGSPa_bSB9Q.png\"></figure><p>The <strong>background-repeat </strong>property fixed this for us. Now the size of the background is the size we set it as.</p>\n<figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*y6b2U4q8MN1JTJSg7obsRw.png\"></figure><p>And it wraps!</p>\n<p>The CSS code is below for your convenience.</p>\n<blockquote>background-image: linear-gradient(to right, rgba(180, 180, 180, 0.8), rgba(180, 180, 180, 0.2));</blockquote>\n<blockquote>display: inline;</blockquote>\n<blockquote>background-position: 0 0.6em;</blockquote>\n<blockquote>background-size: 100% 0.8em;</blockquote>\n<blockquote>background-repeat: repeat-x;</blockquote>\n<p>There are limitations to this technique like not being able to round the background, but if I find a better way to do this I’ll make sure to post it. If you already know a better way, let me know in the comments.</p>\n<img src=\"https://medium.com/_/stat?event=post.clientViewed&amp;referrerSource=full_rss&amp;postId=4e42d28aa343\" width=\"1\" height=\"1\" alt=\"\">\n",
        "enclosure": {},
        "categories": [
            "html",
            "programming",
            "css",
            "style",
            "code"
        ],
        "id": "4e42d28aa343"
    }
]