[
   {
      "id": "1",
      "title": "Turning An Idea Into A Reality",
      "subTitle": "I built an app.",
      "thumbnail": "https://cdn-images-1.medium.com/max/1024/0*a3L7KQrSEtxsa2-c",
      "link": "https://medium.com/@athletecoder/turning-an-idea-into-a-reality-a75af7170fc3?source=rss-bfbe96e0fb27------2",
      "author": "John Nguyen",
      "published": 1643211469000,
      "created": 1643211469000,
      "category": [
         "entrepreneurship",
         "ideas",
         "app-development",
         "fear-of-failure",
         "coding"
      ],
      "preview": "Jazz music was quietly playing in the background, my laptop rested on the coffee table in front of me, and a Coconut Vietnamese coffee accompanied it ...",
      "content": "<p>Jazz music was quietly playing in the background, my laptop rested on the coffee table in front of me, and a Coconut Vietnamese coffee accompanied it. Coconut Vietnamese coffee soon became my new favorite. I could feel the soreness in my bum beginning to kick in from sitting on a hard wooden chair for over 2 hours. I suddenly notice my teeth gnawing at a fingernail. I pull my finger away from my mouth and lay them on the table.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*k6DYMimQrjXLMJif\" /><figcaption>Photo by <a href=\"https://unsplash.com/@romanbozhko?utm_source=medium&amp;utm_medium=referral\">Roman Bozhko</a> on <a href=\"https://unsplash.com?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>I took my gaze away from the screen and moved it to the view in front of me. The sun beamed through the glass windows. The light faded to a dim from the left side of the coffee shop to the right side. There were tables neatly placed around the coffee bar below. The shop was wrapped around with roads and trees. The different shades of green elevated the sense of life. People on motorbikes would constantly speed past. Most were single riders, but some would have multiple passengers. On occasion, I would see riders with multiple boxes stacked on top of each other balancing on the back of the bike. How did they not fall over?</p><p>“What are you going to do with your life,” I asked myself.</p><p>This question seemed to be a common occurrence at the time. I would typically tell myself that I’m going to be a professional football player. But, when I would tell myself that I truly didn’t believe it. The dream of playing professional football seemed unattainable. It seemed beyond my reach. I lost faith.</p><p>After what felt like hours, but was only a couple of minutes, the space between each thought began to expand. And then suddenly It became quiet inside my head for a long brief moment.</p><p>“What if I can create a tool and/or service tailored to athletes, like myself, to help them enhance their training?”</p><p>And that’s the first time the idea popped into my head. At the time, in 2019, I was on my soul-searching trip through Vietnam. The issue was I didn’t know how to bring that idea to life. I didn’t have enough money. Most of the money I made was already invested in this trip. And I didn’t have the knowledge or skills to build it on my own. I only knew the basics of HTML, CSS, and JavaScript (JS).</p><p>Fast forward to the end of January of 2020 (I abandoned the idea for a while), I was in Louisville, Kentucky employed as an IT Consultant. Most days I would arrive at the office about 10 minutes before 9, place a k-cup in the coffee machine, ponder what I’m doing with myself, grab my coffee and then walk over to my desk. I was hardly engaged with what I was doing, so I found myself constantly wondering about life. But one day, the idea reappeared in my thoughts. I felt determined. I told myself I had nothing to lose and all the world to gain.</p><p>I brainstormed a couple of strategic options. I came down to two. I could wait until I had enough money to invest in contractors to build it for me, or I could teach myself the skills to do it on my own. The journey to do it on my own had less risk and more benefits if failure was the outcome. I also knew it was going to be a challenge.</p><p>I typed into the Google search bar, “How to build an application from scratch?” “Have an idea, create a plan, and execute.” I already knew most of these things. I was asking the wrong questions. I needed to know exactly what tech stack I was going to use and how I was going to apply them.<br> I had experience with JS so I stuck with it. NodeJs as the backend environment and JS, HTML, and CSS as the frontend. Doing additional research on frontend development, I stumbled upon JS frameworks. What I learned is that JS frameworks are prewritten JS code that allows for easier development. There were multiple JS frameworks to choose from; <strong>React</strong>, Vue and Angular were the most popular. <a href=\"https://reactjs.org/\"><strong>React</strong></a> seemed the most appealing based on popularity, so I decided to go with it.</p><p>I typed, “Tutorials on React,” into Google’s search bar. <a href=\"http://Udemy.com\">Udemy</a> was the first result. It was a website I’ve heard about before through numerous ads. I arrived on Udemy’s website, created an account, and found a course called, “Modern React and Redux.” I didn’t know what Redux was, but it had plenty of reviews and almost a 5-star rating so I bought it.</p><p>5:30 the next morning, and I’m in my apartment sitting in front of my laptop computer screen starting the first lesson of “Modern React and Redux.” And for the next month and a half, I would spend most mornings, for an hour or so, tackling each instructional video.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*a3L7KQrSEtxsa2-c\" /><figcaption>Photo by <a href=\"https://unsplash.com/@altumcode?utm_source=medium&amp;utm_medium=referral\">AltumCode</a> on <a href=\"https://unsplash.com?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>After completing the course, I had a good understanding of the React Framework and how <a href=\"https://react-redux.js.org/\">Redux</a> integrated with it. But I needed to apply what I learned to reality.</p><p>A good buddy of mine recently started a podcast that focused on reviewing books and beers. It was the perfect opportunity for me to apply what I learned so I created a website for them.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/1*FEMaWPMT6h-QopBZ_OUQFg.png\" /><figcaption>The homepage of the website I created for the podcast</figcaption></figure><p>The website had a store, blog, admin panel, and basic pages that every website needs. The store was the most difficult to implement. <a href=\"https://stripe.com/\"><strong>Stripe’s API</strong></a> (payment processor) documentation was very easy to go through, but figuring out how to configure the process from item to cart, and then cart to checkout was difficult.</p><p>I continued building other websites for leisure. Coming up with random ideas and then trying to bring those ideas to life. Then one day, I stumbled upon React Native when I was scrolling through Youtube. <a href=\"https://reactnative.dev/\">React Native</a> is a framework used to develop mobile and web applications, but mainly used for mobile applications.</p><p>“Why not?” I asked myself. I already have experience with React. The world is going towards mobile devices if it hasn’t already. It will be a useful skill to have under my belt. Plus, my training idea will need to be mobile-first.</p><p>I googled “React Native,” navigated to their website, clicked on the “Get Started” button on the homepage, and then skimmed through their documentation. For newbies, like myself, the documentation recommended using <a href=\"https://expo.dev/\"><strong>Expo CLI</strong></a> to get started. So I dove right into it.</p><p>For my first mobile application with React Native, I built a social networking application called, “LetsLink.” It was an app where you were only shown other users within a 1-mile radius. It was complex, but I learned more about how to interact with APIs and honed my skills in React and Redux.</p><p>In my next app, I was a little intimidated at first, but I ejected my Expo CLI app into a bare workflow environment. Soon I came to realize it wasn’t as bad as I thought, and that Google is my best friend.</p><p>In July of 2021, I was in San Diego, CA visiting my brother. It was a sunny afternoon and I was taking a stroll along the beach. A couple of hours prior, I submitted my first app to the app store. It was a <a href=\"https://habt-b0f23.web.app/\">habit tracker app</a>. I felt confident. “I’m ready,” I whispered to myself with the thought of my main idea in mind.</p><p>The following day at about 6:30 AM, I walked over, with a black coffee in hand, to my brother’s standing desk with my laptop resting on top of it. I opened the lid of the laptop and took a couple of sips of coffee while I waited for the laptop to boot up. When the login screen displayed I took one last sip of my coffee and rested the coffee mug to the left of my laptop. I typed in my login credentials.</p><p>I spent the next 4 hours or so brainstorming the functionalities of the app, and creating a broad timeline of the process from scratch to launch. I planned for the app to be on the app store towards the end of December of 2021, so that gave me about 4 months.</p><p>That same afternoon, after working out and spending some downtime with family and friends, I found myself back at the desk working on designing the prototype in <a href=\"https://www.figma.com/\">Figma</a> (a prototype software). I spent the next week designing a prototype of the app. Design isn’t my strong suit, but I tried my best to say the least.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*IS1mh5NZIwsxM5hg\" /><figcaption>Photo by <a href=\"https://unsplash.com/@balazsketyi?utm_source=medium&amp;utm_medium=referral\">Balázs Kétyi</a> on <a href=\"https://unsplash.com?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>I was looking outside the airplane window on my way back to Seattle, WA. Being above the clouds makes you wonder if you could just choose to see the brighter side of things. Sometimes we get so caught up below the clouds that we don’t even wonder what’s above it.</p><p>Is this going to work? Are people going to like it? What if it fails? It’s going to be embarrassing.</p><p>These negative self-degrading thoughts make a frequent occurrence throughout my pursuit for the next couple of months. I had no choice but to implement a routine to keep these thoughts at bay.</p><p>I was normally awake at 6:00 AM. Made coffee, took out the dogs, meditated for 10 minutes, and worked from 6:30 -7:00 AM until about 10:00 AM — 11:00 AM. I worked in 90-minute intervals with 20-minute breaks in between. Then I would eat breakfast, work out, and be back at it at around 2:00 -3:00 PM until about 6:00–7:00 PM. I would have dinner, and then, depending on how I was feeling, I would squeeze in another hour or so before I would get ready for bed. I was in bed at around 9:00 PM and asleep at 10:00 PM. I was consistent most days, but obviously, life and procrastination would sometimes get in the way.</p><p>It’s always the first couple of minutes of my work session where my mind would complain about how I don’t want to be doing this right now. And then suddenly, my mind would transition into a deep state of focus on the task at hand. I started to enjoy diving into those work sessions.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*-umRWDH1aVlAH_7C\" /><figcaption>Photo by <a href=\"https://unsplash.com/@avirichards?utm_source=medium&amp;utm_medium=referral\">Avi Richards</a> on <a href=\"https://unsplash.com?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>It’s Mid-December and I had an overwhelming amount of work to be done. I’ve made significant progress, but there was a lot of design and content configuration that needed to be done. I audibled and planned for the app to be completed by the end of December and to hopefully submit the app towards the beginning of January.</p><p>January 10th, I was in Denver, Colorado visiting a friend I met in college. It was an early Friday morning, the sun beamed through the window and onto my face. I’m standing at a tall round wooden table with my laptop resting on top of it. I feel a sense of relief as I hit the submit button. My app is finally done. For now.</p><p>This was only the start of this app’s journey. This first release was just the MVP (minimal viable product) version. More like a beta version. This app still needs a lot of work. I know things didn’t go exactly how I planned in July, but I’m glad I accomplished my main goal and that was to complete and submit the app.</p><figure><img alt=\"\" src=\"https://cdn-images-1.medium.com/max/1024/0*BncmMbXS9mSNgh6H\" /><figcaption>Photo by <a href=\"https://unsplash.com/@nullplus?utm_source=medium&amp;utm_medium=referral\">Razvan Chisu</a> on <a href=\"https://unsplash.com?utm_source=medium&amp;utm_medium=referral\">Unsplash</a></figcaption></figure><p>Feel free to check out the app I created <a href=\"https://www.softlete.com/\">here</a>. Let me know what you think through the feedback form on the website.</p><img src=\"https://medium.com/_/stat?event=post.clientViewed&referrerSource=full_rss&postId=a75af7170fc3\" width=\"1\" height=\"1\" alt=\"\">"
   }
]